app/controllers/information_fragments_controller.rb

	def search
    @information_fragments = InformationFragment.find( :all, :include => "user", :conditions=>["information_fragments.keywords like ?", "%#{params[:q]}%"])
---
SELECT * FROM `information_fragments` WHERE (information_fragments.keywords like '%お寿司%')
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def show
    @information_fragment = InformationFragment.find(params[:id])
---
SELECT * FROM `information_fragments` WHERE (`information_fragments`.`id` = 0)